#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github.github_team_repository.simde_terraform has changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"40ce7c42e303f36198dd0003447cc2fb53d78661ae6ad6a19fecf6313e801df1\"" -> "W/\"054e99fb962f3c264720bdf1935d02ade6c2b05636a1de05c478c305e713ec37\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.flairsou_flairsou-api has changed
  ~ resource "github_team_repository" "flairsou_flairsou-api" {
      ~ etag       = "W/\"ea0bdeaf34aa4c8a9d119a271427c433a2ffad8b859d0c7b1a8ac880ed59f0db\"" -> "W/\"0ac12ac9eef46ba56f769b8d98f6f9a4fd0acd968f5d64c25c2948fe994760e6\""
        id         = "4276153:flairsou-api"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_flairsou-api has changed
  ~ resource "github_team_repository" "simde_flairsou-api" {
      ~ etag       = "W/\"ea0bdeaf34aa4c8a9d119a271427c433a2ffad8b859d0c7b1a8ac880ed59f0db\"" -> "W/\"0ac12ac9eef46ba56f769b8d98f6f9a4fd0acd968f5d64c25c2948fe994760e6\""
        id         = "4217733:flairsou-api"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github.github_team.sparkle will be created
  + resource "github_team" "sparkle" {
      + create_default_maintainer = false
      + description               = "Développer la nouvelle version de Sparkle"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Sparkle"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.discord_simde.module.mael_belval.discord_member_roles.member_role will be updated in-place
  ~ resource "discord_member_roles" "member_role" {
        id        = "198571768"
        # (2 unchanged attributes hidden)

      + role {
          + has_role = true
          + role_id  = "938907292085125130"
        }
        # (2 unchanged blocks hidden)
    }

  # module.github.module.cesar_richard.github_team_membership.membership["sparkle"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "cesar-richard"
    }

  # module.github.module.mael_belval.github_team_membership.membership["sparkle"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "mael-belval"
    }

  # module.github.module.repositories.github_branch_protection.sparkle_master will be created
  + resource "github_branch_protection" "sparkle_master" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "master"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = "sparkle"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }
    }

  # module.github.module.repositories.github_repository.sparkle will be created
  + resource "github_repository" "sparkle" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Les calculs n'étaient pas bons Kevin !"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "sparkle"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_team_repository.simde_sparkle will be created
  + resource "github_team_repository" "simde_sparkle" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "sparkle"
      + team_id    = "4217733"
    }

  # module.github.module.repositories.github_team_repository.sparkle_sparkle will be created
  + resource "github_team_repository" "sparkle_sparkle" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "sparkle"
      + team_id    = (known after apply)
    }

  # module.github.module.romain_maliachauguste.github_team_membership.membership["sparkle"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "R0one"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*